Import do pandas como 'pd'

In [2]:
import pandas as pd

Cria dois data frames simples com id e nome e id idade

In [3]:
data_frame1 = {'ID': [1,2,3,4,5],
               'Nome': ['Ana','Bernardo','Ricardo','Xirú','Paulinho']}

data_frame2 = {'ID': [1,2,3,4,5],
               'Idade': [25,20,30,90,18]}

#Exibe os dois data frames
print(f"{data_frame1}\n{data_frame2}")

{'ID': [1, 2, 3, 4, 5], 'Nome': ['Ana', 'Bernardo', 'Ricardo', 'Xirú', 'Paulinho']}
{'ID': [1, 2, 3, 4, 5], 'Idade': [25, 20, 30, 90, 18]}

Converte os dois DFs para o formato do pandas

In [4]:
df1 = pd.DataFrame(data_frame1)
df2 = pd.DataFrame(data_frame2)

print(f"{df1}\n\n{df2}")

   ID      Nome
0   1       Ana
1   2  Bernardo
2   3   Ricardo
3   4      Xirú
4   5  Paulinho

   ID  Idade
0   1     25
1   2     20
2   3     30
3   4     90
4   5     18

Faz um merge (unificação) dos dois DFs pelo unificador 'ID' como inner-join.

In [5]:
merge_data_frame = pd.merge(df1, df2, on='ID', how='inner')
merge_data_frame

   ID      Nome  Idade
0   1       Ana     25
1   2  Bernardo     20
2   3   Ricardo     30
3   4      Xirú     90
4   5  Paulinho     18

Calcula a média e moda usando pandas na coluna 'idade'

In [6]:
media = merge_data_frame['Idade'].mean()
media

np.float64(36.6)

In [7]:
moda = merge_data_frame['Idade'].mode()
moda

0    18
1    20
2    25
3    30
4    90
Name: Idade, dtype: int64

Cria uma tabela com condição usando campo idade (Maior de 20 anos)

In [8]:
merge_data_frame['Maior 20 anos'] = merge_data_frame['Idade'] >= 20
merge_data_frame

   ID      Nome  Idade  Maior 20 anos
0   1       Ana     25           True
1   2  Bernardo     20           True
2   3   Ricardo     30           True
3   4      Xirú     90           True
4   5  Paulinho     18          False

In [9]:
merge_data_frame.reset_index(drop=True, inplace=True)
merge_data_frame

   ID      Nome  Idade  Maior 20 anos
0   1       Ana     25           True
1   2  Bernardo     20           True
2   3   Ricardo     30           True
3   4      Xirú     90           True
4   5  Paulinho     18          False

In [10]:
grupo_idade = merge_data_frame.groupby('Maior 20 anos')['Idade'].mean()
grupo_idade

Maior 20 anos
False    18.00
True     41.25
Name: Idade, dtype: float64

Ordena o data_frame de acordo com a idade de forma crescente (ascending=True)

In [11]:
merge_data_frame = merge_data_frame.sort_values(by='Idade', ascending=True)
merge_data_frame.reset_index(drop=True, inplace=True) #Usado para ajeitar a ordem dos index(id)
merge_data_frame

   ID      Nome  Idade  Maior 20 anos
0   5  Paulinho     18          False
1   2  Bernardo     20           True
2   1       Ana     25           True
3   3   Ricardo     30           True
4   4      Xirú     90           True